In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = Series([4,7,5,3])

In [3]:
obj

0    4
1    7
2    5
3    3
dtype: int64

In [4]:
obj.values

array([4, 7, 5, 3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj[[1,3,2]]

1    7
3    3
2    5
dtype: int64

In [7]:
obj[obj>4]

1    7
2    5
dtype: int64

In [8]:
7 in obj

False

In [9]:
1 in obj

True

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj2 = pd.Series(sdata)

In [13]:
obj2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
print(obj4)
pd.isnull(obj4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [36]:
obj4.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj4['Bob'] = 345
obj4

Bob        345.0
Steve    35000.0
Jeff     16000.0
Ryan     71000.0
dtype: float64

In [37]:
data = {'stata': ['Ohio', 'ohio', 'ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2000, 2001, 2004],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [39]:
frame = pd.DataFrame(data)

In [42]:
frame

    stata  year  pop
0    Ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9
5  Nevada  2004  3.2

In [49]:
frame.head()

    stata  year  pop
0    Ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9

In [57]:
pd.DataFrame(data, columns=['year', 'pop', 'stata'])

   year  pop   stata
0  2000  1.5    Ohio
1  2001  1.7    ohio
2  2002  3.6    ohio
3  2000  2.4  Nevada
4  2001  2.9  Nevada
5  2004  3.2  Nevada

In [58]:
frame['stata']

0      Ohio
1      ohio
2      ohio
3    Nevada
4    Nevada
5    Nevada
Name: stata, dtype: object

In [67]:
frame.year

0    2000
1    2001
2    2002
3    2000
4    2001
5    2004
Name: year, dtype: int64

In [69]:
frame.loc[3]

stata    Nevada
year       2000
pop         2.4
Name: 3, dtype: object

In [72]:
import numpy as np
frame['debt'] = np.arange(6)
frame

    stata  year  pop  debt
0    Ohio  2000  1.5     0
1    ohio  2001  1.7     1
2    ohio  2002  3.6     2
3  Nevada  2000  2.4     3
4  Nevada  2001  2.9     4
5  Nevada  2004  3.2     5

In [94]:
frame['extern'] = frame.stata == 'Ohio'
frame

    stata  year  pop  extern
0    Ohio  2000  1.5    True
1    ohio  2001  1.7   False
2    ohio  2002  3.6   False
3  Nevada  2000  2.4   False
4  Nevada  2001  2.9   False
5  Nevada  2004  3.2   False

In [96]:
frame.columns

Index(['stata', 'year', 'pop', 'extern'], dtype='object')

In [97]:
frame.T

           0      1      2       3       4       5
stata   Ohio   ohio   ohio  Nevada  Nevada  Nevada
year    2000   2001   2002    2000    2001    2004
pop      1.5    1.7    3.6     2.4     2.9     3.2
extern  True  False  False   False   False   False